test_config/cfe/Catalogs/AVS_КатегорииНоменклатурыСайт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>AVS_КатегорииНоменклатурыСайт</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СсылкаНаИзображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

test_config/cfe/InformationRegisters/AVS_СоставКатегорийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>AVS_СоставКатегорийНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СвязкаАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AVS_КатегорииНоменклатурыСайт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

test_config/cfe/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеРеквизитыИСведения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Виден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВладелецДополнительныхЗначений</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыводитьВВидеГиперссылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеЗначенияИспользуются</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеЗначенияСВесом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Доступен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыВыбораЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МногострочноеПолеВвода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодсказкаЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодсказкаЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФорматСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦветСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ТипЗначенияХарактеристики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AVS_ТипЗначенияХарактеристики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ВариантыЗначений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ГруппаХарактеристик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ТипСвязки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AVS_ТипСвязки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

test_config/cfe/Catalogs/AVS_КатегорииНоменклатурыСайт/Forms/AVS_ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура AVS_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	// 1. Настройка параметров динамических списков
		УстановитьПараметрыДинамическихСписков();
		
	// 2. Отображение GUID
	Если Не Объект.Ссылка.Пустая() Тогда
                
        GUIDКатегории = Строка(Объект.Ссылка.УникальныйИдентификатор());
    Иначе
        GUIDКатегории = "GUID будет создан при записи!";
    КонецЕсли;
    
    // 3. Настройка интерфейса (растягивание)
    Элементы.СтраницыКатегории.РастягиватьПоВертикали = Истина;
    Элементы.СтраницаХарактеристики.РастягиватьПоВертикали = Истина;
    Элементы.ТаблицаХарактеристикиКатегории.РастягиватьПоВертикали = Истина;
    Элементы.СтраницаТовары.РастягиватьПоВертикали = Истина;
    Элементы.ТаблицаТоварыКатегории.РастягиватьПоВертикали = Истина;
	
    // 4. Скрытие лишних команд управления товарами
    Попытка
        // --- А) СКРЫВАЕМ СТАНДАРТНЫЕ КНОПКИ ---
        // Для Таблицы Значений стандартные кнопки называются так:
        Элементы.ТаблицаТоварыКатегорииДобавить.Видимость = Ложь;
        Элементы.ТаблицаТоварыКатегорииУдалить.Видимость  = Ложь;
        Элементы.ТаблицаТоварыКатегорииСкопировать.Видимость = Ложь;
		
		КнВверх = Элементы.ТаблицаТоварыКатегорииПереместитьВверх;
        КнВниз  = Элементы.ТаблицаТоварыКатегорииПереместитьВниз;
        
        Панель = Элементы.ТаблицаТоварыКатегорииКоманднаяПанель;
        КнУдалитьКастом = Элементы.КнопкаУдалитьТовар; // Наша кнопка "Удалить"
        
        // Ставим стандартные стрелочки ПЕРЕД нашей кнопкой "Удалить"
        // (в итоге они окажутся сразу после нашей кнопки "Добавить")
        ЭтаФорма.Элементы.Переместить(КнВверх, Панель, КнУдалитьКастом);
        ЭтаФорма.Элементы.Переместить(КнВниз,  Панель, КнУдалитьКастом);
        
        // --- В) ЧИСТИМ КОНТЕКСТНОЕ МЕНЮ (правая кнопка мыши) ---
        Элементы.ТаблицаТоварыКатегорииКонтекстноеМенюДобавить.Видимость = Ложь;
        Элементы.ТаблицаТоварыКатегорииКонтекстноеМенюУдалить.Видимость  = Ложь;
        Элементы.ТаблицаТоварыКатегорииКонтекстноеМенюСкопировать.Видимость = Ложь;
        
    Исключение
        // Игнорируем, если каких-то элементов нет (защита от ошибок платформы)
    КонецПопытки;

    // 5. Автоматическая установка порядка сортировки для новых элементов
    Если Объект.Ссылка.Пустая() И Параметры.Ключ.Пустая() Тогда
        Если Объект.ПорядокСортировки = 0 Тогда
            Объект.ПорядокСортировки = AVS_ПолучитьСледующийПорядокКатегорииНаСервере(Объект.Родитель);
        КонецЕсли;
	КонецЕсли;
	
	// 11.04.2026 Загружаем характеристики текущей категории и всех родителей (ТЗ 1.4)
	AVS_ЗагрузитьХарактеристикиНаСервере();
	AVS_ЗагрузитьТоварыНаСервере();
	
	// { ПРАВКА: 10.04.2026 Условное оформление таблицы характеристик (ТЗ 1.4) }
	
	// Создаем новый элемент оформления
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.ИдентификаторПользовательскойНастройки = "AVS_ХарактеристикиРодителей"; // Ключ для поиска
	
	// 1. Что оформляем: Цвет текста = Серый
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
	// 2. Когда оформляем: Источник НЕ РАВЕН текущей категории
	КомпоновкаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КомпоновкаОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СписокХарактеристикКатегории.Источник");
	КомпоновкаОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	КомпоновкаОтбора.ПравоеЗначение = Объект.Ссылка; // При создании здесь ПустаяСсылка
	КомпоновкаОтбора.Использование  = Истина;
	
	// 3. Где оформляем: Вся строка таблицы
	ПолеОформления = Элемент.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТаблицаХарактеристикиКатегории");
	
		
	// { КОНЕЦ ПРАВКИ }
	
КонецПроцедуры  


// { ПРАВКА: 11.04.2026 Процедура загрузки характеристик с учетом новых объектов }
&НаСервере
Процедура AVS_ЗагрузитьХарактеристикиНаСервере()
	
	СписокХарактеристикКатегории.Очистить();
	
	// 1. Определяем массив категорий для поиска характеристик
	Если Объект.Ссылка.Пустая() Тогда
		// Для нового элемента берем цепочку от родителя (ТЗ 1.4)
		МассивКат = AVS_ВыгрузкаНаСайт.AVS_ПолучитьМассивРодителей(Объект.Родитель);
	Иначе
		// Для существующего - от самого себя
		МассивКат = AVS_ВыгрузкаНаСайт.AVS_ПолучитьМассивРодителей(Объект.Ссылка);
		МассивКат.Добавить(Объект.Ссылка);
	КонецЕсли;
	
	// 2. Запрос характеристик
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	Свойство, 
	|	ПорядокСортировки, 
	|	Категория КАК Источник,
	|	ВЫБОР КОГДА Категория = &ТекущаяКатегория ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ТипИсточника
	|ИЗ 
	|	РегистрСведений.AVS_ХарактеристикиКатегорий 
	|ГДЕ 
	|	Категория В (&Массив)
	|УПОРЯДОЧИТЬ ПО 
	|	ТипИсточника ВОЗР, 
	|	ПорядокСортировки ВОЗР";
	
	Запрос.УстановитьПараметр("Массив", МассивКат);
	Запрос.УстановитьПараметр("ТекущаяКатегория", Объект.Ссылка);
	
	СписокХарактеристикКатегории.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


// { ПРАВКА: Обработчик изменения родителя для мгновенного обновления характеристик }
&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	AVS_ЗагрузитьХарактеристикиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическихСписков()
	
	// 1. Параметры для списка ХАРАКТЕРИСТИК (с учетом наследования)
	МассивКатегорий = AVS_ВыгрузкаНаСайт.AVS_ПолучитьМассивРодителей(Объект.Ссылка);
	
	// Если категория новая, но родитель выбран - показываем его характеристики для превью
	Если МассивКатегорий.Количество() = 0 И ЗначениеЗаполнено(Объект.Родитель) Тогда
		МассивКатегорий = AVS_ВыгрузкаНаСайт.AVS_ПолучитьМассивРодителей(Объект.Родитель);
	КонецЕсли;
	
		
КонецПроцедуры	
	
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда Возврат; КонецЕсли;
	// 1. СРАВНЕНИЕ ХАРАКТЕРИСТИК (уже было)
    // { ПРАВКА: Умное определение изменений характеристик }
	Набор = РегистрыСведений.AVS_ХарактеристикиКатегорий.СоздатьНаборЗаписей();
	Набор.Отбор.Категория.Установить(ТекущийОбъект.Ссылка);
	
	// Формируем таблицу нового состава для сравнения
	НовыйСостав = Новый ТаблицаЗначений;
	НовыйСостав.Колонки.Добавить("Свойство");
	НовыйСостав.Колонки.Добавить("ПорядокСортировки");
	
	Для Каждого Стр Из СписокХарактеристикКатегории Цикл
		// Своими считаем те, где источник пуст (новые) или совпадает с нами
		Если Стр.Источник.Пустая() Или Стр.Источник = ТекущийОбъект.Ссылка Тогда
			НоваяСтр = НовыйСостав.Добавить();
			НоваяСтр.Свойство = Стр.Свойство;
			НоваяСтр.ПорядокСортировки = Стр.ПорядокСортировки;
		КонецЕсли;
	КонецЦикла;
	НовыйСостав.Сортировать("Свойство");
	
	// Читаем текущий состав из БД
	Набор.Прочитать();
	СтарыйСостав = Набор.Выгрузить();
	СтарыйСостав.Сортировать("Свойство");
	
	// Сравниваем составы
	ХарактеристикиИзменены = Ложь;
	Если СтарыйСостав.Количество() <> НовыйСостав.Количество() Тогда
		ХарактеристикиИзменены = Истина;
	Иначе
		Для Сч = 0 По СтарыйСостав.Количество() - 1 Цикл
			Если СтарыйСостав[Сч].Свойство <> НовыйСостав[Сч].Свойство 
			   Или СтарыйСостав[Сч].ПорядокСортировки <> НовыйСостав[Сч].ПорядокСортировки Тогда
				ХарактеристикиИзменены = Истина; Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Если характеристики изменились — ставим флаг для общего модуля
	Если ХарактеристикиИзменены Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("AVS_ХарактеристикиИзменены", Истина);
	КонецЕсли;
	
	// 2. СРАВНЕНИЕ ТОВАРОВ
	Запрос = Новый Запрос("ВЫБРАТЬ Номенклатура, СвязкаАктивна ИЗ РегистрСведений.AVS_СоставКатегорийНоменклатуры ГДЕ Категория = &Кат");
	Запрос.УстановитьПараметр("Кат", ТекущийОбъект.Ссылка);
	ТабБаза = Запрос.Выполнить().Выгрузить();
	
	МассивЗатронутыхТоваров = Новый Массив;
	ТоварыИзменены = Ложь;

	МассивНовых      = Новый Массив; // Те, кого нет в базе (INSERT)
	МассивИзмененных = Новый Массив; // Те, кто есть, но сменил галочку (UPDATE)
	МассивУдаленных  = Новый Массив; // Те, кто исчез из списка (AUTO: UPDATE/DELETE)
	
	ТоварыИзменены = Ложь;

	// 1. Сравниваем базу с формой (ищем Удаленных и Измененных)
	Для Каждого СтрБаза Из ТабБаза Цикл
		Отбор = Новый Структура("Номенклатура", СтрБаза.Номенклатура);
		НайденныеСтроки = СписокТоваровКатегории.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			МассивУдаленных.Добавить(СтрБаза.Номенклатура);
			ТоварыИзменены = Истина;
		ИначеЕсли НайденныеСтроки[0].СвязкаАктивна <> СтрБаза.СвязкаАктивна Тогда
			МассивИзмененных.Добавить(СтрБаза.Номенклатура);
			ТоварыИзменены = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// 2. Сравниваем форму с базой (ищем Новых)
	Для Каждого СтрФорма Из СписокТоваровКатегории Цикл
		Отбор = Новый Структура("Номенклатура", СтрФорма.Номенклатура);
		Если ТабБаза.НайтиСтроки(Отбор).Количество() = 0 Тогда
			МассивНовых.Добавить(СтрФорма.Номенклатура);
			ТоварыИзменены = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ТоварыИзменены Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("AVS_МассивНовых",      МассивНовых);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("AVS_МассивИзмененных", МассивИзмененных);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("AVS_МассивУдаленных",  МассивУдаленных);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("AVS_ТоварыИзменены",   Истина);
	КонецЕсли;	
    
КонецПроцедуры

&После("ПриЗаписиНаСервере")
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Если основная запись уже была отменена по каким-то причинам, ничего не делаем
	Если Отказ Тогда Возврат; КонецЕсли;
	
	// 1. ЗАПИСЬ ХАРАКТЕРИСТИК
	// { ПРАВКА: Запись характеристик только когда Ссылка уже точно есть }
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("AVS_ХарактеристикиИзменены") Тогда
		
		Набор = РегистрыСведений.AVS_ХарактеристикиКатегорий.СоздатьНаборЗаписей();
		Набор.Отбор.Категория.Установить(ТекущийОбъект.Ссылка);
		
		Для Каждого Стр Из СписокХарактеристикКатегории Цикл
			Если Стр.Источник.Пустая() Или Стр.Источник = ТекущийОбъект.Ссылка Тогда
				Запись = Набор.Добавить();
				Запись.Категория = ТекущийОбъект.Ссылка; // Теперь ссылка НЕ ПУСТАЯ
				Запись.Свойство = Стр.Свойство;
				Запись.ПорядокСортировки = Стр.ПорядокСортировки;
				
				// Обновляем визуально на форме
				Стр.Источник = ТекущийОбъект.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		// Флаг "ЗаписьИзФормы" нужен, чтобы подписка регистра не дублировала события
		Набор.ДополнительныеСвойства.Вставить("AVS_ЗаписьИзФормы", Истина);
		Набор.Записать();
		
	КонецЕсли;
	
	// 2. ЗАПИСЬ ТОВАРОВ (ОДНИМ ПАКЕТОМ)
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("AVS_ТоварыИзменены") Тогда
		
		Набор = РегистрыСведений.AVS_СоставКатегорийНоменклатуры.СоздатьНаборЗаписей();
		Набор.Отбор.Категория.Установить(ТекущийОбъект.Ссылка);
		
		Для Каждого Стр Из СписокТоваровКатегории Цикл
			Запись = Набор.Добавить();
			Запись.Категория = ТекущийОбъект.Ссылка;
			Запись.Номенклатура = Стр.Номенклатура;
			Запись.СвязкаАктивна = Стр.СвязкаАктивна;
		КонецЦикла;
		
		Набор.Записать(Истина); // Физически обновляем регистр
		
		// 3. РЕГИСТРАЦИЯ ИЗМЕНЕНИЙ ДЛЯ САЙТА
		Для Каждого Товар Из ТекущийОбъект.ДополнительныеСвойства.AVS_МассивНовых Цикл
			AVS_ПриЗаписиНоменклатуры.ЗарегистрироватьИзменениеТовара(Товар, "INSERT");
		КонецЦикла;
		
		// ИЗМЕНЕННЫЕ (галочка) -> Обновление (UPDATE)
		Для Каждого Товар Из ТекущийОбъект.ДополнительныеСвойства.AVS_МассивИзмененных Цикл
			AVS_ПриЗаписиНоменклатуры.ЗарегистрироватьИзменениеТовара(Товар, "UPDATE");
		КонецЦикла;
		
		// УДАЛЕННЫЕ -> Авто-выбор (UPDATE если остался в др. категориях, иначе DELETE)
		Для Каждого Товар Из ТекущийОбъект.ДополнительныеСвойства.AVS_МассивУдаленных Цикл
			AVS_ПриЗаписиНоменклатуры.ЗарегистрироватьИзменениеТовара(Товар);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

 &НаКлиенте
Процедура ПроверитьСсылкуКомандаВыполнить(Команда)
    
    Ссылка = Объект.СсылкаНаИзображение;
    
    Если ПустаяСтрока(Ссылка) Тогда
        ПоказатьПредупреждение(Новый ОписаниеОповещения("ПослеПустойСсылки", ЭтотОбъект),
            "Ссылка на изображение не указана!");
        Возврат;
    КонецЕсли;
    
    // Проверяем и добавляем протокол
    Если Найти(Ссылка, "http://") = 0 И Найти(Ссылка, "https://") = 0 Тогда
        Ссылка = "http://" + Ссылка;
    КонецЕсли;
    
    // Используем ДРУГОЕ имя переменной
    ПараметрыОповещения = Новый Структура;
    ПараметрыОповещения.Вставить("Ссылка", Ссылка);
    
    ПоказатьВопрос(Новый ОписаниеОповещения("ПослеПодтвержденияОткрытия", ЭтотОбъект, ПараметрыОповещения),
        "Открыть в браузере ссылку?" + Символы.ПС + Ссылка,
        РежимДиалогаВопрос.ДаНет);
    
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияОткрытия(Результат, ПараметрыОповещения) Экспорт
    
    Если Результат = КодВозвратаДиалога.Да Тогда
        Ссылка = ПараметрыОповещения.Ссылка;
        ЗапуститьПриложение(Ссылка);
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура AVS_ПриЧтенииНаСервереВместо(ТекущийОбъект)
    
    // Обновляем все списки при переключении между элементами
	УстановитьПараметрыДинамическихСписков();
	
	
	//11.04.2026 { ПРАВКА: Обновляем таблицу характеристик }
	AVS_ЗагрузитьХарактеристикиНаСервере();
	AVS_ЗагрузитьТоварыНаСервере();
	
	// Обновляем GUID на форме
	Если Не ТекущийОбъект.Ссылка.Пустая() Тогда
		GUIDКатегории = Строка(ТекущийОбъект.Ссылка.УникальныйИдентификатор());
	КонецЕсли;
    
КонецПроцедуры

// Добавим обработчик удаления для появления звездочки
&НаКлиенте
Процедура СписокХарактеристикКатегорииПередУдалением(Элемент, Отказ)
	// При удалении строки динамического списка тоже ставим звездочку
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокХарактеристикКатегорииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	// Если это новая строка - заполняем источник
	Если НоваяСтрока Тогда
		ТекущиеДанные.Источник = Объект.Ссылка;
		ТекущиеДанные.ПорядокСортировки = 50; // Значение по умолчанию
	КонецЕсли;
	
	// Запрещаем редактировать родительские характеристики (ТЗ 1.4)
	Если ТекущиеДанные.Источник <> Объект.Ссылка Тогда
		Элемент.ТолькоПросмотр = Истина; 
		// Чтобы не блокировать всю таблицу, лучше использовать Отказ в ПередНачаломИзменения
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокХарактеристикКатегорииПередНачаломИзменения(Элемент, Отказ)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Источник <> Объект.Ссылка Тогда
		// Родительские характеристики менять нельзя, их нужно менять в родительской категории
		Отказ = Истина; 
		ПоказатьПредупреждение(, "Эту характеристику можно изменить только в категории: " + ТекущиеДанные.Источник);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура AVS_ПослеЗаписиПосле(ПараметрыЗаписи)
	// Вызываем серверную процедуру для принудительного обновления списка
	AVS_ОбновитьСписокПослеЗаписиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура AVS_ДобавитьХарактеристикуКомандаВместо(Команда)
	// Рассчитываем порядок на основании данных в таблице формы
    МаксПорядок = 0;
    Для Каждого Стр Из СписокХарактеристикКатегории Цикл
        МаксПорядок = Макс(МаксПорядок, Стр.ПорядокСортировки);
    КонецЦикла;
    СледующийПорядок = МаксПорядок + 10;
    
    Оповещение = Новый ОписаниеОповещения("ВыбратьХарактеристикуПосле", ЭтотОбъект, СледующийПорядок);
    
    ПараметрыОтбора = Новый Структура("AVS_ВыгружатьНаСайт", Истина);
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("РежимВыбора", Истина);
    ПараметрыФормы.Вставить("Отбор",       ПараметрыОтбора);
	
	
    ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаВыбора", 
        ПараметрыФормы, ЭтотОбъект, , , , Оповещение);	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьХарактеристикуПосле(Результат, Порядок) Экспорт
    
    Если Результат = Неопределено Тогда Возврат; КонецЕсли;
    
    // 1. Проверяем на дубли прямо в таблице формы
    Для Каждого Стр Из СписокХарактеристикКатегории Цикл
        Если Стр.Свойство = Результат Тогда
            ПоказатьПредупреждение(, "Эта характеристика уже добавлена в список!");
            Возврат;
        КонецЕсли;
    КонецЦикла;
    
    // 2. Добавляем строку в Таблицу Значений на форме (в базу пока ничего не пишем!)
    НоваяСтрока = СписокХарактеристикКатегории.Добавить();
    НоваяСтрока.Свойство = Результат;
    НоваяСтрока.Источник = Объект.Ссылка; // Для новой категории будет пустая ссылка, это нормально
    НоваяСтрока.ПорядокСортировки = Порядок;
	
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ХарактеристикаУжеДобавлена(Категория, Характеристика)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ПЕРВЫЕ 1 1 КАК Флаг
    |ИЗ
    |   РегистрСведений.AVS_ХарактеристикиКатегорий КАК Характеристики
    |ГДЕ
    |   Характеристики.Категория = &Категория
    |   И Характеристики.Свойство = &Свойство";
    
    Запрос.УстановитьПараметр("Категория", Категория);
    Запрос.УстановитьПараметр("Свойство", Характеристика);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Возврат Выборка.Следующий();
    
КонецФункции

&НаКлиенте
Процедура ТаблицаХарактеристикиКатегорииПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	// { ПРАВКА: Запрет удаления родительских характеристик (ТЗ 1.4) }
	Если ТекущиеДанные.Источник <> Объект.Ссылка Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(, "Нельзя удалить характеристику, унаследованную от родительской категории!");
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура AVS_ХарВверхКоманда(Команда)
	Таблица = СписокХарактеристикКатегории;
	ТекДанные = Элементы.ТаблицаХарактеристикиКатегории.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	// 1. Саму родительскую строку двигать нельзя
	Если ЗначениеЗаполнено(ТекДанные.Источник) И ТекДанные.Источник <> Объект.Ссылка Тогда
		Возврат;
	КонецЕсли;
	
	Индекс = Таблица.Индекс(ТекДанные);
	Если Индекс > 0 Тогда
		
		// 2. Проверяем строку, которая стоит ВЫШЕ
		СтрокаВыше = Таблица[Индекс - 1];
		Если СтрокаВыше.Источник <> Объект.Ссылка Тогда
			// Выше стоит родительская характеристика. "Своя" не может быть выше родительской.
			ПоказатьПредупреждение(, "Характеристики текущей категории не могут быть выше родительских!");
			Возврат;
		КонецЕсли;
		
		Таблица.Сдвинуть(Индекс, -1);
		ОбновитьПорядокСортировкиВТаблице();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура AVS_ХарВнизКоманда(Команда)
	Таблица = СписокХарактеристикКатегории;
	ТекДанные = Элементы.ТаблицаХарактеристикиКатегории.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	// Родительские строки не двигаем
	Если ЗначениеЗаполнено(ТекДанные.Источник) И ТекДанные.Источник <> Объект.Ссылка Тогда
		Возврат;
	КонецЕсли;
	
	Индекс = Таблица.Индекс(ТекДанные);
	Если Индекс < Таблица.Количество() - 1 Тогда
		
		// Проверка на случай, если внизу вдруг оказалась родительская (хотя они обычно сверху)
		СтрокаНиже = Таблица[Индекс + 1];
		Если СтрокаНиже.Источник <> Объект.Ссылка Тогда
			Возврат;
		КонецЕсли;

		Таблица.Сдвинуть(Индекс, 1);
		ОбновитьПорядокСортировкиВТаблице();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьПорядокСортировкиВТаблице()
	
	ТекущийПорядок = 0;
	
	Для Каждого Стр Из СписокХарактеристикКатегории Цикл
		
		// Определяем, является ли строка "своей" (учитываем новые объекты с пустой ссылкой)
		ЭтоСвояСтрока = (Стр.Источник = Объект.Ссылка) Или (Не ЗначениеЗаполнено(Стр.Источник));
		
		Если Не ЭтоСвояСтрока Тогда
			// 1. Для родительских строк просто запоминаем их порядок как базу для отсчета
			ТекущийПорядок = Макс(ТекущийПорядок, Стр.ПорядокСортировки);
		Иначе
			// 2. Для "своих" строк увеличиваем порядок, начиная от последнего родительского
			ТекущийПорядок = ТекущийПорядок + 10;
			Стр.ПорядокСортировки = ТекущийПорядок;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Серверный wrapper для логирования (так как модуль AVS_Логирование недоступен на клиенте)
&НаСервереБезКонтекста
Процедура AVS_ЗаписатьВЛогНаСервере(ТекстСообщения)
	
	Попытка
		AVS_Логирование.ЗаписатьВЛог(ТекстСообщения);
	Исключение
		ЗаписьЖурналаРегистрации("AVS.Интеграция", УровеньЖурналаРегистрации.Ошибка, , , 
			"Критическая ошибка логирования: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСледующийПорядокНаСервере(Категория)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   МАКСИМУМ(Характеристики.ПорядокСортировки) КАК МаксПорядок
    |ИЗ
    |   РегистрСведений.AVS_ХарактеристикиКатегорий КАК Характеристики
    |ГДЕ
    |   Характеристики.Категория = &Категория";
    
    Запрос.УстановитьПараметр("Категория", Категория);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        МаксПорядок = Выборка.МаксПорядок;
        
        // Проверяем, что значение не NULL и имеет тип Число
        Если МаксПорядок = Неопределено ИЛИ НЕ ТипЗнч(МаксПорядок) = Тип("Число") Тогда
            Возврат 10;
        Иначе
            Возврат МаксПорядок + 10;
        КонецЕсли;
        
    Иначе
        Возврат 10;
    КонецЕсли;
    
КонецФункции

&НаСервере
Функция AVS_ПолучитьСледующийПорядокКатегорииНаСервере(Родитель)
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	МАКСИМУМ(Категории.ПорядокСортировки) КАК МаксПорядок
    |ИЗ
    |	Справочник.AVS_КатегорииНоменклатурыСайт КАК Категории
    |ГДЕ
    |	Категории.Родитель = &Родитель";
    
    Запрос.УстановитьПараметр("Родитель", Родитель);
    
    Попытка
        Результат = Запрос.Выполнить();
        Выборка = Результат.Выбрать();
        
        Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.МаксПорядок) Тогда
            Возврат Выборка.МаксПорядок + 10;
        Иначе
            Возврат 10;
        КонецЕсли;
    Исключение
        Возврат 10;
    КонецПопытки;
КонецФункции

&НаСервере
Процедура AVS_РегистрацияИзмененияКатегории(Категория)
    
    // Проверка типа входящего параметра для предотвращения падения сервера
    Если Не ЗначениеЗаполнено(Категория) Тогда
        Возврат;
    КонецЕсли;
    
    Попытка
        // Проверка наличия перечисления и общего модуля
        ВидСобытия = ПредопределенноеЗначение("Перечисление.AVS_ВидСобытия.UPDATE");
        AVS_ОбщийМодульСайт.AVS_ЗарегистрироватьИзменение(Категория, ВидСобытия);
    Исключение
        ТекстОшибки = "[AVS ERROR]: Ошибка регистрации изменений на сервере: " + ОписаниеОшибки();
        Сообщить(ТекстОшибки);
        ЗаписьЖурналаРегистрации("AVS.Интеграция", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
    КонецПопытки;
    
КонецПроцедуры


#Область Товары 

// { ПРАВКА: Загрузка товаров из регистра в буфер формы }
&НаСервере
Процедура AVS_ЗагрузитьТоварыНаСервере()
	
	СписокТоваровКатегории.Очистить();
	
	Если Объект.Ссылка.Пустая() Тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Состав.Номенклатура КАК Номенклатура,
	|	Состав.СвязкаАктивна КАК СвязкаАктивна
	|ИЗ
	|	РегистрСведений.AVS_СоставКатегорийНоменклатуры КАК Состав
	|ГДЕ
	|	Состав.Категория = &Категория";
	
	Запрос.УстановитьПараметр("Категория", Объект.Ссылка);
	СписокТоваровКатегории.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура AVS_ДобавитьТоварВКатегориюВместо(Команда)
Если Объект.Ссылка.Пустая() Тогда
        ПоказатьПредупреждение(, "Сначала сохраните категорию!");
        Возврат;
    КонецЕсли;
    
    Оповещение = Новый ОписаниеОповещения("ВыбратьТоварыПосле", ЭтотОбъект);
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("РежимВыбора", Истина);
    ПараметрыФормы.Вставить("МножественныйВыбор", Истина); 
    
    ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, , , , , Оповещение);
КонецПроцедуры
    
&НаКлиенте
Процедура ВыбратьТоварыПосле(Результат, ДополнительныеПараметры) Экспорт
    
   Если Результат = Неопределено Тогда Возврат; КонецЕсли;
    
    ВыбранныеТовары = ?(ТипЗнч(Результат) = Тип("Массив"), Результат, Новый Массив);
    Если ТипЗнч(Результат) <> Тип("Массив") Тогда ВыбранныеТовары.Добавить(Результат); КонецЕсли;
    
    // Вызываем серверный метод для безопасного добавления в ТЗ
    AVS_ДобавитьТоварыВБуферНаСервере(ВыбранныеТовары);      
КонецПроцедуры  

&НаСервере
Процедура AVS_ДобавитьТоварыВБуферНаСервере(МассивТоваров)
    
    Для Каждого Товар Из МассивТоваров Цикл
        // На сервере метод НайтиСтроки доступен
        ПараметрыОтбора = Новый Структура("Номенклатура", Товар);
        Если СписокТоваровКатегории.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
            НоваяСтр = СписокТоваровКатегории.Добавить();
            НоваяСтр.Номенклатура = Товар;
            НоваяСтр.СвязкаАктивна = Истина;
            ЭтаФорма.Модифицированность = Истина;
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура AVS_ДобавитьТоварВКатегориюВместоНаСервере(ВыбранныеТовары)
	НачатьТранзакцию();
    
    Попытка
        Набор = РегистрыСведений.AVS_СоставКатегорийНоменклатуры.СоздатьНаборЗаписей();
        Набор.Отбор.Категория.Установить(Объект.Ссылка);
        
        // 1. Читаем текущий состав из базы, чтобы ДОПОЛНИТЬ его
        Набор.Прочитать(); 
        
        // 2. Индексируем текущие товары для быстрого поиска дублей
        СуществующиеТовары = Новый Соответствие;
        Для Каждого Запись Из Набор Цикл
            СуществующиеТовары.Вставить(Запись.Номенклатура, Истина);
        КонецЦикла;
        
        // 3. Добавляем только новые товары
        НовыхДобавлено = 0;
        Для Каждого Товар Из ВыбранныеТовары Цикл
            Если СуществующиеТовары[Товар] = Неопределено Тогда
                НоваяЗапись = Набор.Добавить();
                НоваяЗапись.Категория = Объект.Ссылка;
                НоваяЗапись.Номенклатура = Товар;
                НоваяЗапись.СвязкаАктивна = Истина;
                
                СуществующиеТовары.Вставить(Товар, Истина);
                НовыхДобавлено = НовыхДобавлено + 1;
            КонецЕсли;
        КонецЦикла;
        
        // 4. Записываем весь набор (старые + новые)
        Набор.Записать(Истина);
        
        AVS_РегистрацияИзмененияКатегории(Объект.Ссылка);
        
        ЗафиксироватьТранзакцию();
        Сообщить(СтрШаблон("[AVS DEBUG]: Добавлено новых: %1. Всего в категории: %2", НовыхДобавлено, Набор.Количество()));
        
    Исключение
        ОтменитьТранзакцию();
        Сообщить("[AVS ERROR]: Ошибка массового добавления: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ТоварУжеДобавленВКатегорию(Категория, Товар)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ПЕРВЫЕ 1 1 КАК Флаг
    |ИЗ
    |   РегистрСведений.AVS_СоставКатегорийНоменклатуры КАК Состав
    |ГДЕ
    |   Состав.Категория = &Категория
    |   И Состав.Номенклатура = &Номенклатура";
    
    Запрос.УстановитьПараметр("Категория", Категория);
    Запрос.УстановитьПараметр("Номенклатура", Товар);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Возврат Выборка.Следующий();
    
КонецФункции

&НаКлиенте
Процедура УдалитьТоварИзКатегории(Команда)
    
    ТекущаяСтрока = Элементы.ТаблицаТоварыКатегории.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда Возврат; КонецЕсли;
    
    // Проверка возможности удаления (ТЗ 1.6)
    РезультатПроверки = AVS_ПроверитьВозможностьУдаленияТовараНаСервере(ТекущаяСтрока.Номенклатура);
    
    Если РезультатПроверки.Разрешено Тогда
        // В Тонком клиенте Удалить() работает по объекту строки
        СписокТоваровКатегории.Удалить(ТекущаяСтрока);
        ЭтаФорма.Модифицированность = Истина;
    Иначе
        ПоказатьПредупреждение(, РезультатПроверки.Сообщение);
    КонецЕсли;    
    
КонецПроцедуры

&НаСервере
Процедура УдалитьТоварИзКатегорииНаСервере(Категория, Товар)
    
    // { ПРАВКА_НАЧАЛО: Проверка перед удалением товара из категории (08.04.2026)
	// Требование ТЗ: если после удаления у товара не останется ни одной категории,
	// но он участвует в связке номенклатуры — запрещаем удаление и выводим сообщение.
	// Видимость (запись в регистре) не меняется.
	// Добавлена полная отладочная информация и безопасные проверки.
	// }
	Попытка
		
		Сообщить("[AVS DEBUG]: === ПРОВЕРКА ПЕРЕД УДАЛЕНИЕМ ТОВАРА ИЗ КАТЕГОРИИ ===");
		Сообщить("[AVS DEBUG]: Категория = " + Строка(Категория) + ", Товар = " + Строка(Товар));
		
		// 1. Проверка корректности параметров
		Если Не ЗначениеЗаполнено(Товар) Или ТипЗнч(Товар) <> Тип("СправочникСсылка.Номенклатура") Тогда
			Сообщить("[AVS WARNING]: Некорректный параметр Товар (пустой или неверный тип).");
			// Продолжаем выполнение оригинального кода (не блокируем)
		ИначеЕсли Не ЗначениеЗаполнено(Категория) Или ТипЗнч(Категория) <> Тип("СправочникСсылка.AVS_КатегорииНоменклатурыСайт") Тогда
			Сообщить("[AVS WARNING]: Некорректный параметр Категория (пустой или неверный тип).");
		Иначе
			
			// 2. Определяем текущее количество категорий у товара
			КоличествоКатегорий = 0;
			Попытка
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	КОЛИЧЕСТВО(*) КАК Количество
				|ИЗ
				|	РегистрСведений.AVS_СоставКатегорийНоменклатуры КАК Состав
				|ГДЕ
				|	Состав.Номенклатура = &Номенклатура";
				
				Запрос.УстановитьПараметр("Номенклатура", Товар);
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					КоличествоКатегорий = Выборка.Количество;
				КонецЕсли;
			Исключение
				Сообщить("[AVS ERROR]: Ошибка при подсчёте количества категорий: " + ОписаниеОшибки());
			КонецПопытки;
			
			Сообщить("[AVS DEBUG]: Текущее количество категорий у товара = " + Строка(КоличествоКатегорий));
			
			// 3. Проверяем участие товара в связке
			УчаствуетВСвязке = Ложь;
			ИдентификаторСвязки = Неопределено;
			Попытка
				Если ЗначениеЗаполнено(Товар) Тогда
					ИдентификаторСвязки = AVS_ОбщийМодульСайт.ПолучитьИдентификаторСвязкиТовара(Товар);
					УчаствуетВСвязке = ЗначениеЗаполнено(ИдентификаторСвязки);
				КонецЕсли;
			Исключение
				Сообщить("[AVS WARNING]: Не удалось проверить участие в связке: " + ОписаниеОшибки());
			КонецПопытки;
			
			Сообщить("[AVS DEBUG]: Участие в связке = " + ?(УчаствуетВСвязке, "ДА (GUID: " + Строка(ИдентификаторСвязки) + ")", "НЕТ"));
			
			// 4. Основная проверка по требованию
			Если КоличествоКатегорий <= 1 И УчаствуетВСвязке Тогда
				
				Сообщить("[AVS DEBUG]: === УДАЛЕНИЕ ЗАБЛОКИРОВАНО ===");
				Сообщить("Товар не может быть сейчас удалён из категории, т.к. участвует в связке товаров. Сначала удалите товар из связки.");
				Сообщить("[AVS DEBUG]: Запись в регистре AVS_СоставКатегорийНоменклатуры НЕ УДАЛЕНА.");
				
				// Записываем в лог
				Попытка
					AVS_ЗаписатьВЛогНаСервере("Попытка удаления заблокирована. Товар: " + Строка(Товар) + 
						", Категория: " + Строка(Категория) + 
						". Причина: последняя категория + участие в связке.");
				Исключение
				КонецПопытки;
				
				Возврат; // ← ВЫХОДИМ БЕЗ УДАЛЕНИЯ ЗАПИСИ
			КонецЕсли;
			
			Сообщить("[AVS DEBUG]: Проверка пройдена. Продолжаем удаление записи из регистра.");
			
		КонецЕсли;
		
	Исключение
		Сообщить("[AVS ERROR]: Ошибка в блоке проверки удаления товара из категории: " + ОписаниеОшибки());
		// При любой ошибке в проверке — продолжаем оригинальное удаление (не блокируем функционал)
	КонецПопытки;
	// { ПРАВКА_КОНЕЦ }
	
	// ============================================================================
	// ОРИГИНАЛЬНЫЙ КОД (без изменений)
	// ============================================================================
	
	// Удаляем запись через менеджер записи
	МенеджерЗаписи = РегистрыСведений.AVS_СоставКатегорийНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Категория = Категория;
	МенеджерЗаписи.Номенклатура = Товар;
	
	Попытка
		МенеджерЗаписи.Удалить();
		
		// Регистрируем изменение категории
		AVS_РегистрацияИзмененияКатегории(Категория);
		
	Исключение
		// Игнорируем ошибку, если записи нет
	КонецПопытки;
    
КонецПроцедуры

&НаКлиенте
Процедура AVS_ОбновитьСписокТоваровВместо(Команда)
	// Перечитываем данные из базы в буфер (с потерей несохраненных изменений!)
	AVS_ЗагрузитьТоварыНаСервере();
КонецПроцедуры

 
// { ПРАВКА_НАЧАЛО: Прямое переключение статуса в списке и массовая обработка }

&НаКлиенте
Процедура ТаблицаТоварыКатегорииСвязкаАктивнаПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаТоварыКатегории.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	// Если пользователь ПЫТАЕТСЯ СНЯТЬ галочку (новое значение = Ложь)
	Если ТекДанные.СвязкаАктивна = Ложь Тогда
		
		РезультатПроверки = AVS_ПроверитьВозможностьОтключенияВидимостиНаСервере(ТекДанные.Номенклатура);
		
		Если Не РезультатПроверки.Разрешено Тогда
			// Возвращаем галочку назад
			ТекДанные.СвязкаАктивна = Истина;
			ПоказатьПредупреждение(, РезультатПроверки.Сообщение);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура AVS_ЗаписатьСтатусСвязкиНаСервере(Товар, НовоеСостояние)
	
	// Проверка типов параметров
	Если Не ЗначениеЗаполнено(Товар) Тогда Возврат; КонецЕсли;
	
	// Используем менеджер записи для точечного обновления
	МенеджерЗаписи = РегистрыСведений.AVS_СоставКатегорийНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Товар;
	МенеджерЗаписи.Категория    = Объект.Ссылка;
	
	МенеджерЗаписи.Прочитать(); // Читаем, чтобы не потерять другие данные строки
	МенеджерЗаписи.СвязкаАктивна = НовоеСостояние;
	
	Попытка
		МенеджерЗаписи.Записать(Истина); // Замещать = Истина
	Исключение
		ВызватьИсключение "Ошибка записи в регистр: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоварыКатегорииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// 1. Если мы хотим, чтобы двойной клик по колонке "Номенклатура" 
	// открывал карточку товара, а не переключал галочку:
	Если Поле.Имя = "ТаблицаТоварыКатегорииНоменклатура" Тогда
		Возврат; // СтандартнаяОбработка останется Истина, и откроется карточка
	КонецЕсли;

	// 2. Для остальных колонок (или если кликнули прямо по галочке)
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ТаблицаТоварыКатегории.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		
		// Если сейчас галочка СТОИТ и её хотят СНЯТЬ
		Если ТекДанные.СвязкаАктивна = Истина Тогда
			
			РезультатПроверки = AVS_ПроверитьВозможностьОтключенияВидимостиНаСервере(ТекДанные.Номенклатура);
			
			Если Не РезультатПроверки.Разрешено Тогда
				ПоказатьПредупреждение(, РезультатПроверки.Сообщение);
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		// Переключаем значение
		ТекДанные.СвязкаАктивна = Не ТекДанные.СвязкаАктивна;
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура AVS_АктивироватьВыделенныеТовары(Команда)
	
	Для Каждого Ид Из Элементы.ТаблицаТоварыКатегории.ВыделенныеСтроки Цикл
		Стр = СписокТоваровКатегории.НайтиПоИдентификатору(Ид);
		Если Стр <> Неопределено Тогда
			Стр.СвязкаАктивна = Истина;
		КонецЕсли;
	КонецЦикла;
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура AVS_ИзменитьСтатусГруппеНаСервере(МассивТоваров, НовыйСтатус)
	
	// { ИСПРАВЛЕНО }: Работаем с массивом ссылок, а не с элементами формы
	Для Каждого ТоварСсылка Из МассивТоваров Цикл
		AVS_ЗаписатьСтатусСвязкиНаСервере(ТоварСсылка, НовыйСтатус);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция AVS_ПроверитьВозможностьУдаленияТовараНаСервере(Товар)
    
    Результат = Новый Структура("Разрешено, Сообщение", Истина, "");
    
    // 1. Считаем количество категорий у товара в БАЗЕ
    Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК КолВо ИЗ РегистрСведений.AVS_СоставКатегорийНоменклатуры ГДЕ Номенклатура = &Товар");
    Запрос.УстановитьПараметр("Товар", Товар);
    Выборка = Запрос.Выполнить().Выбрать();
    
    КолВоКатегорий = 0;
    Если Выборка.Следующий() Тогда КолВоКатегорий = Выборка.КолВо; КонецЕсли;
    
    // 2. Если это последняя категория, проверяем участие в связке
    Если КолВоКатегорий <= 1 Тогда
        Связка = AVS_ОбщийМодульСайт.ПолучитьИдентификаторСвязкиТовара(Товар);
        Если ЗначениеЗаполнено(Связка) Тогда
            Результат.Разрешено = Ложь;
            Результат.Сообщение = "Товар не может быть удалён из последней категории, так как он участвует в связке товаров!";
        КонецЕсли;
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции

&НаСервере
Функция AVS_ПроверитьВозможностьОтключенияВидимостиНаСервере(Товар)
    
    Результат = Новый Структура("Разрешено, Сообщение", Истина, "");
    
    // 1. Считаем количество АКТИВНЫХ связей товара с категориями в БАЗЕ
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	КОЛИЧЕСТВО(*) КАК КолВо
    |ИЗ
    |	РегистрСведений.AVS_СоставКатегорийНоменклатуры КАК Состав
    |ГДЕ
    |	Состав.Номенклатура = &Товар
    |	И Состав.СвязкаАктивна = ИСТИНА";
    
    Запрос.УстановитьПараметр("Товар", Товар);
    Выборка = Запрос.Выполнить().Выбрать();
    
    КолВоАктивных = 0;
    Если Выборка.Следующий() Тогда КолВоАктивных = Выборка.КолВо; КонецЕсли;
    
    // 2. Если это последняя активная категория, проверяем участие в связке вариаций
    Если КолВоАктивных <= 1 Тогда
        Связка = AVS_ОбщийМодульСайт.ПолучитьИдентификаторСвязкиТовара(Товар);
        Если ЗначениеЗаполнено(Связка) Тогда
            Результат.Разрешено = Ложь;
            Результат.Сообщение = "Нельзя отключить видимость товара в этой категории, так как он участвует в связке вариаций и это его последняя активная категория!";
        КонецЕсли;
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции




#КонецОбласти

&НаСервере
Процедура AVS_ОбновитьСписокПослеЗаписиНаСервере()
    
    // 1. Обновляем параметры динамических списков (характеристики и товары)
	УстановитьПараметрыДинамическихСписков();
	
	// 2. ОБНОВЛЯЕМ GUID (теперь ссылка заполнена, и мы можем её вывести)
	GUIDКатегории = Строка(Объект.Ссылка.УникальныйИдентификатор());
    
КонецПроцедуры
